
## Plan Result (test)




<pre><code>Plan: 2 to add, 5 to change, 0 to destroy.</code></pre>

* Create
  * random_password.session_string_v2
  * module.keyvault_secrets.azurerm_key_vault_secret.secret[&#34;session-key-v2&#34;]
* Update
  * module.action-group.azurerm_resource_group_template_deployment.action-group
  * module.apim_product[0].azurerm_api_management_product.product
  * module.automation_runbook_client_secret_rotation[&#34;apps&#34;].azurerm_automation_schedule.client_serects
  * module.automation_runbook_client_secret_rotation[&#34;apps&#34;].azurerm_automation_schedule.client_serects_trigger_once
  * module.redis-v6.azurerm_redis_cache.redis


<details><summary>Change Result (Click me)</summary>

```hcl

  # random_password.session_string_v2 will be created
  + resource "random_password" "session_string_v2" {
      + bcrypt_hash = (sensitive value)
      + id          = (known after apply)
      + keepers     = {
          + "expiry_date" = "2025-10-03T01:00:00Z"
        }
      + length      = 20
      + lower       = true
      + min_lower   = 2
      + min_numeric = 2
      + min_special = 2
      + min_upper   = 2
      + number      = true
      + numeric     = true
      + result      = (sensitive value)
      + special     = true
      + upper       = true
    }

  # module.action-group.azurerm_resource_group_template_deployment.action-group will be updated in-place
  ~ resource "azurerm_resource_group_template_deployment" "action-group" {
        id                       = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/pip-ss-test-rg/providers/Microsoft.Resources/deployments/CaTH-Group"
        name                     = "CaTH-Group"
        tags                     = {}
      ~ template_content         = jsonencode(
          ~ {
              ~ outputs        = {
                  ~ actionGroupId = {
                      ~ type  = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                }
              ~ parameters     = {
                  ~ actionGroupName      = {
                      ~ type = "String" -> "string"
                    }
                  ~ emailReceiverAddress = {
                      ~ type     = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ emailReceiverName    = {
                      ~ type     = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ location             = {
                      ~ type         = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ shortName            = {
                      ~ type = "String" -> "string"
                    }
                }
                # (3 unchanged attributes hidden)
            }
        )
        # (6 unchanged attributes hidden)
    }

  # module.apim_product[0].azurerm_api_management_product.product will be updated in-place
  ~ resource "azurerm_api_management_product" "product" {
        id                    = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/ss-test-network-rg/providers/Microsoft.ApiManagement/service/sds-api-mgmt-test/products/pip-product-test"
      ~ subscriptions_limit   = 0 -> 20
        # (9 unchanged attributes hidden)
    }

  # module.automation_runbook_client_secret_rotation["apps"].azurerm_automation_schedule.client_serects will be updated in-place
  ~ resource "azurerm_automation_schedule" "client_serects" {
        id                      = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/pip-ss-test-rg/providers/Microsoft.Automation/automationAccounts/pip-ss-test-aa/schedules/rotate-client-secrets-schedule"
        name                    = "rotate-client-secrets-schedule"
      ~ start_time              = "2024-08-31T01:00:00Z" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.automation_runbook_client_secret_rotation["apps"].azurerm_automation_schedule.client_serects_trigger_once will be updated in-place
  ~ resource "azurerm_automation_schedule" "client_serects_trigger_once" {
        id                      = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/pip-ss-test-rg/providers/Microsoft.Automation/automationAccounts/pip-ss-test-aa/schedules/rotate-client-secrets-schedule-single-trigger"
        name                    = "rotate-client-secrets-schedule-single-trigger"
      ~ start_time              = "2024-08-30T11:38:00Z" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.keyvault_secrets.azurerm_key_vault_secret.secret["session-key-v2"] will be created
  + resource "azurerm_key_vault_secret" "secret" {
      + expiration_date         = "2025-03-01T01:00:00Z"
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/pip-ss-test-rg/providers/Microsoft.KeyVault/vaults/pip-ss-kv-test"
      + name                    = "session-key-v2"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = {
          + "application"         = "publishing-information-service"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/pip-shared-infrastructures.git"
          + "businessArea"        = "Cross-Cutting"
          + "contactSlackChannel" = "#publishing-and-information"
          + "environment"         = "testing"
          + "managedBy"           = "Future Hearings - Publishing Information Project"
          + "purpose"             = "b2c-session"
        }
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.redis-v6.azurerm_redis_cache.redis will be updated in-place
  ~ resource "azurerm_redis_cache" "redis" {
        id                            = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/pip-v6-cache-test/providers/Microsoft.Cache/redis/pip-v6-test"
        name                          = "pip-v6-test"
        tags                          = {
            "application"         = "publishing-information-service"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/pip-shared-infrastructures.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#publishing-and-information"
            "environment"         = "testing"
            "managedBy"           = "Future Hearings - Publishing Information Project"
        }
        # (23 unchanged attributes hidden)

      ~ redis_configuration {
          ~ maxfragmentationmemory_reserved         = 125 -> 200
          ~ maxmemory_delta                         = 125 -> 200
          ~ maxmemory_reserved                      = 125 -> 200
            # (14 unchanged attributes hidden)
        }
    }

Plan: 2 to add, 5 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":188,"Program":"tfcmt","SHA1":"","Target":"test","Vars":{}} -->